
//贷款管理
export const loanManage = {
    verifyState_F: ["待验证","验证中","验证通过","验证失败","已请求"] ,
    marryType: ["已婚", "未婚", "离异", "丧偶"],
    boolenChildren: ["有", "无"],
    educationType: ["高中及以下", "大专", "本科", "本科及以上"] ,
    booleanCar: ["无车", "有车 有车贷", "有车 无车贷"],
    creditCardType: ["无信用卡或贷款", "信用良好", "1年内逾期少于3次且少于90天", "1年内逾期超过3次或超过90天"],
    houseType :["无房","有房 有房贷","有房 无房贷"] ,
    typeState:["供应链","流水贷"] ,
    status_R: {
        "000": "待发起",
        "001": "追回",
        "002": "拒绝",
        "003": "完成补件" ,
        "111": "审批中",
        "990": "取消",
        "991": "拿回",
        "992": "打回",
        "993": "退回",
        "994": "作废",
        "995": "补件中",
        "996": "激活",
        "997": "通过",
        "998": "否决",
    },
}

//资金方贷款
export const fundLoan ={
    step:["贷前申请","初审","复审","审核通过","居间费待付","放款"] ,
    status: ["未审核", "审核通过", "驳回", "拒绝", "放款", "居间费待付", "居间费已付", "居间费退款中", "居间费退款成功", "已还款"],
}

//支付管理
export const payManage ={
    //银行卡列表---类型、状态、支付通道
    type:["结算","还款","支付"] ,
    status:{
        "10":"绑定处理中",
        "20":"绑定失败",
        "30":"绑定成功",
        "40":"解绑成功"
    },
    channel:["中金","汇付"],
    //居间服务费---退款状态、交易状态、支付渠道、支付类型
    refundState: ["退款处理中", "退款成功", "退款失败","退款未决"],
    payStatus: ["待发起","成功","失败","支付中","已撤销","已退款"],
    payChannel: {
        "101":"汇付天下",
        "102":"兴业银行",
        "103":"融信通",
        "104":"中金"
    },
    payType:["未知","支付","收入"]
}

//运营管理
export const operateManage ={
    //访问记录---状态
    statuType_V: ["待激活","正常","冻结"] ,
    //注册用户---状态
    status_G: ["待激活","正常","冻结"] ,
    status_A: ["启用","禁用"] ,
    //产品管理---产品类型：
    type_P: ["流水贷","供应链"],
    //贷款用户
    businessNature_U:["个体工商户","有限公司"],
    status_U: ["贷前申请","初审","复审","资金审批通过","居间费","放款"],
    operationStatus_U:["未审核","审核通过","驳回","拒绝","放款","居间费待付","居间费已付","居间费退款中","居间费退款成功","已还款","居间费退款失败"],
    //SAAS渠道
    type_S:["供应链","流水贷","商超"],
    state_S:["启用","禁用"]
}

//食美SaaS订单
export const shiMeiOrder = {
    //SaaS订单---支付方式、订单状态
    payType_O: ["贷款支付", "微信支付", "支付宝支付","小额支付","微信公众号支付","快捷支付","现金支付"],
    orderStatus_O: ["建立订单", "取消订单", "配货","发货","签收"],
}

//系统管理
export const system = {
    //菜单管理---类型
    type_M: ["目录", "菜单", "按钮"]

}